code-review/NRB_3471_3546/База_Было/DataProcessors/ВыгрузкаНКДВBackQort.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаНКДВBackQort</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ВыгрузкаНКДВBackQort/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура выгружает НКД ценных бумаг в BackQort
//
// Параметры:
//  УИДСообщенияПервогоЗапроса	 - Строка - Идентификатор первого исходного сообщения запроса
//  УИДСообщенияЗапроса			 - Строка - Идентификатор сообщения запроса
//  ТекстыОшибок				 - Массив - Коллекция для накапливания текстов об ошибках в процессе выгрузки
//
Процедура ВыгрузитьВBackQort(УИДСообщенияПервогоЗапроса = Неопределено, УИДСообщенияЗапроса = Неопределено,
	ТекстыОшибок = Неопределено) Экспорт
	
	ВыборкаНКДПоЦеннымБумагам = ВыборкаНКДПоЦеннымБумагам();
	
	ПараметрыВыгрузкиЦБ =
		Новый Структура("ВыборкаНКДПоЦеннымБумагам,УИДСообщенияПервогоЗапроса,УИДСообщенияЗапроса,ВсегоКВыгрузке,НомерВыгрузки");
	ПараметрыВыгрузкиЦБ.УИДСообщенияПервогоЗапроса = УИДСообщенияПервогоЗапроса;
	ПараметрыВыгрузкиЦБ.УИДСообщенияЗапроса = УИДСообщенияЗапроса;
	ПараметрыВыгрузкиЦБ.НомерВыгрузки = 0;
	ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке = ВыборкаНКДПоЦеннымБумагам.Количество();
	
	ВыгруженоЦенныхБумаг = 0;
	Если ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке > 0 Тогда
		ПараметрыВыгрузкиЦБ.ВыборкаНКДПоЦеннымБумагам = ВыборкаНКДПоЦеннымБумагам;
		Пока ВыборкаНКДПоЦеннымБумагам.Следующий() Цикл
			ПараметрыВыгрузкиЦБ.НомерВыгрузки = ВыгруженоЦенныхБумаг + 1;
			Успешно = ВыгрузитьНКДПоЦеннойБумаге(ПараметрыВыгрузкиЦБ, ТекстыОшибок);
			ВыгруженоЦенныхБумаг = ?(Успешно, ПараметрыВыгрузкиЦБ.НомерВыгрузки, ВыгруженоЦенныхБумаг);
		КонецЦикла;
	КонецЕсли;
	
	ЭтоВыгрузкаПоЗапросу = УИДСообщенияПервогоЗапроса <> Неопределено;
	Если ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке = 0 И ЭтоВыгрузкаПоЗапросу Тогда
		ПараметрыВыгрузкиЦБ.ВыборкаНКДПоЦеннымБумагам = Неопределено;
		ВыгрузитьНКДПоЦеннойБумаге(ПараметрыВыгрузкиЦБ, ТекстыОшибок);
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Выгружено %1 ценных бумаг", ВыгруженоЦенныхБумаг);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьНКДПоЦеннойБумаге(ПараметрыВыгрузкиЦБ, ТекстыОшибок)
	
	Сущность = "Aci";
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToBqSecuritiesQuotes1642;
	УИДСообщения = Строка(Новый УникальныйИдентификатор);
	Успешно = Ложь;
	ЦеннаяБумага = ?(ПараметрыВыгрузкиЦБ.ВыборкаНКДПоЦеннымБумагам <> Неопределено,
		ПараметрыВыгрузкиЦБ.ВыборкаНКДПоЦеннымБумагам.ЦеннаяБумага, Неопределено);
	
	Попытка
		ТекстJSON = СформироватьJSON(УИДСообщения, Сущность, ПараметрыВыгрузкиЦБ);
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Сущность, ТекстJSON, УИДСообщения, ЦеннаяБумага);
		Успешно = Истина;
	Исключение
		Успешно = Ложь;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Если ТипЗнч(ТекстыОшибок) = Тип("Массив") Тогда
			ТекстыОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

Функция ТекстЗапросаКотировкиЦенныхБумаг()
	Возврат
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	НКД.Период КАК Date,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК RegNum,
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """") КАК AssetCode,
	|	НКД.AccInt КАК AccInt,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ВалютаНоминала = &Рубль
	|			ТОГДА ""RUB""
	|		ИНАЧЕ ЦенныеБумаги.ВалютаНоминала.Наименование
	|	КОНЕЦ КАК Currency,
	|	ВЫБОР
	|		КОГДА НКД.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.CBonds)
	|			ТОГДА ""CBONDS""
	|		КОГДА НКД.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.НРД)
	|			ТОГДА ""NSD""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК SourceAPI
	|ИЗ
	|	РегистрСведений.НКД КАК НКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО НКД.ЦеннаяБумага = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО (ЦенныеБумаги.Ссылка = КодыЗагрузкиЦБ.Владелец)
	|			И (НЕ КодыЗагрузкиЦБ.ПометкаУдаления)
	|			И (КодыЗагрузкиЦБ.Биржа = &НДЦ)
	|			И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > &ТекущаяДата)
	|{ГДЕ
	|	НКД.Период КАК Период,
	|	НКД.Биржа КАК Биржа,
	|	ЦенныеБумаги.Ссылка КАК ЦенныеБумаги}
	|ИТОГИ ПО
	|	ЦеннаяБумага";
КонецФункции

Функция ВыборкаНКДПоЦеннымБумагам()
	ТекстЗапроса = ТекстЗапросаКотировкиЦенныхБумаг();
	ПостроительЗапроса = Новый ПостроительЗапроса(ТекстЗапроса);
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Параметры.Вставить("НДЦ", Справочники.КлассификаторыЗагрузки.NrdCode);
	ПостроительЗапроса.Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	ПостроительЗапроса.Параметры.Вставить("Рубль", Справочники.Валюты.Рубль());
	Отбор = ПостроительЗапроса.Отбор;
	
	Отбор.Добавить("Период");
	Отбор.Период.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	Отбор.Период.Использование = Истина;
	Отбор.Период.ЗначениеС = НачалоПериода;
	Отбор.Период.ЗначениеПо = КонецПериода;
	
	Отбор.Добавить("Биржа");
	Отбор.Биржа.Использование = Истина;
	Отбор.Биржа.ВидСравнения = ВидСравнения.ВСписке;
	СписокБирж = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Биржа) Тогда
		СписокБирж.Добавить(Биржа);
	Иначе
		ИсточникиКотировок = Обработки.ВыгрузкаНКДВBackQort.ВыгружаемыеИсточникиКотировок();
		СписокБирж.ЗагрузитьЗначения(ИсточникиКотировок);
	КонецЕсли;
	Отбор.Биржа.Значение = СписокБирж;
	
	Если ЗначениеЗаполнено(ЦенныеБумаги) Тогда
		Отбор.Добавить("ЦенныеБумаги");
		Отбор.ЦенныеБумаги.ВидСравнения = ВидСравнения.ВСписке;
		Отбор.ЦенныеБумаги.Использование = Истина;
		СписокЦенныхБумаг = Новый СписокЗначений;
		СписокЦенныхБумаг.ЗагрузитьЗначения(ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага").ВыгрузитьКолонку("ЦеннаяБумага"));
		Отбор.ЦенныеБумаги.Значение = СписокЦенныхБумаг;
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	ВыборкаНКДПоЦеннымБумагам = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаНКДПоЦеннымБумагам;
КонецФункции

#Область Kafka

Функция СформироватьJSON(УИДСообщения, Сущность, ПараметрыВыгрузкиЦБ)
	
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(Сущность, "INS", "1.0.1", УИДСообщения);
	MessageInfo.MasterMessageId = ?(ЗначениеЗаполнено(ПараметрыВыгрузкиЦБ.УИДСообщенияПервогоЗапроса),
		ПараметрыВыгрузкиЦБ.УИДСообщенияПервогоЗапроса, УИДСообщения);
	MessageInfo.ParentMessageId = ПараметрыВыгрузкиЦБ.УИДСообщенияЗапроса;
	
	Data = ДанныеData(ПараметрыВыгрузкиЦБ, Сущность + "Data");
	
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ДанныеData(ПараметрыВыгрузкиЦБ, Сущность)
	
	ДанныеПоЦеннымБумагам = Новый Массив;
	
	Если ПараметрыВыгрузкиЦБ.ВыборкаНКДПоЦеннымБумагам <> Неопределено Тогда
		ВыборкаДетальныеЗаписи = ПараметрыВыгрузкиЦБ.ВыборкаНКДПоЦеннымБумагам.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Date = ЗаписатьДатуJSON(ВыборкаДетальныеЗаписи.Date, ФорматДатыJSON.ISO);
			
			Asset = Новый Структура;
			Asset.Вставить("Isin", ВыборкаДетальныеЗаписи.Isin);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(Asset, "AssetCode", СокрЛП(ВыборкаДетальныеЗаписи.AssetCode));
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(Asset, "RegNum", ВыборкаДетальныеЗаписи.RegNum);
			
			ДанныеПоЦеннойБумаге = Новый Структура;
			ДанныеПоЦеннойБумаге.Вставить("Date", Date);
			ДанныеПоЦеннойБумаге.Вставить("Asset", Asset);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "AciSum", ВыборкаДетальныеЗаписи.AccInt);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "Currency", ВыборкаДетальныеЗаписи.Currency);
			
			ДанныеПоЦеннымБумагам.Добавить(ДанныеПоЦеннойБумаге);
			
		КонецЦикла;
	КонецЕсли;
	
	ДанныеКОтправке = Новый Структура;
	ДанныеКОтправке.Вставить(Сущность, ДанныеПоЦеннымБумагам);
	ДанныеКОтправке.Вставить("AssetNumber", ПараметрыВыгрузкиЦБ.НомерВыгрузки);
	ДанныеКОтправке.Вставить("AssetCount", ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке);
	
	Возврат ДанныеКОтправке;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
